{
  "templateKey": "fb-post",
  "date": "2021-05-07T22:42:17.881Z",
  "url": "https://scet.berkeley.edu/event/05-07-scets-collider-cup-viii/",
  "page": "Sutardja Center for Entrepreneurship & Technology",
  "location": "Virtual",
  "title": "SCET’s Collider Cup VIII",
  "id": "3453w4gargegrg",
  "image": "/img/cc8-header-2.jpeg",
  "description": "We may still be remote, but that does not stop our students! In the spirit of innovation, [SCET’s Collider Cup VIII](https://scet.berkeley.edu/students/collider-cup/) will again be virtual, and we have an incredible line-up of the best student venture projects Berkeley has to offer.\n\nJoin us via [Zoom webinar](https://berkeley.zoom.us/webinar/register/WN_MKMNGwkeRGOisiL0njVUmw) on **Friday, May 7th** from **10:00 am – 12:00 pm PST** for the Collider Cup VIII, the Sutardja Center’s all-star showcase of the best student teams from the Spring 2021 semester. Come watch teams pitch to a panel of investors and industry experts as they vie to win the grand prize from our partner fund, [Pear VC](https://www.pear.vc/)!\n\n[Click here](https://berkeley.zoom.us/webinar/register/WN_MKMNGwkeRGOisiL0njVUmw) to register for the event.\n\nWe’re excited to continue our partnership with Pear VC! They partner with founders from the earliest-stage and help them to build category-defining companies. You might know some of their larger portfolio companies including – Guardant Health, Doordash, Gusto, and Branch. They provide founders support with product, customers, recruiting, and fundraising.\n\nThe winning team of the Collider Cup will be fast-tracked to final round interviews for the exclusive Pear Accelerator, in which the Pear partners will work with up to 15 teams for 3-months before a demo day to hundreds of top investors.\n\n[Click here](https://www.pear.vc/) to learn more about Pear VC.\n\n\n\n**Let’s meet our judges**:\n\n![Gary Yin](https://scet.berkeley.edu/wp-content/uploads/garyyin_bright-150x150.jpg)[Gary Yin](https://www.linkedin.com/in/gary-g-yin/) is a fellow at Pear VC and a current Haas MBA student. Prior to Haas, Gary co-founded an edtech startup that provides perks and benefits to K-12 teachers. He’s a former high school math teacher through Teach For America. After teaching, Gary spent time in consulting at EY-Parthenon and in data science at Blue Apron. He’s passionate about working with early stage founders especially in the areas of consumer ai, deeptech, and edtech.\n\n\n\n\n\n![Adithya Iyengar](https://scet.berkeley.edu/wp-content/uploads/Adithya-Iyengar_crop-150x150.jpg)\n\n[Adithya Iyengar](https://www.linkedin.com/in/adithyaiyengar97/), Associate, The House Fund, is a recent graduate from the Electrical Engineering & Computer Sciences program at UC Berkeley and held a variety of roles in student organizations on campus, including leading a consulting group and being a part of the Student Investment Team at The House Fund for 2 years. His most recent role prior to The House Fund was as an analyst at ACME Capital (formerly Sherpa Capital) and he has previously worked with the investment teams of DCM Ventures and Cofounders Capital. Outside of work, Adithya can be found playing soccer or basketball, spending time with friends, and visiting North Carolina (his home state) when possible.\n\n\n\n![](https://scet.berkeley.edu/wp-content/uploads/Jay-Onda-150x150.jpg)[Jay Onda](https://www.linkedin.com/in/jay-onda/) focuses on Startup Investment activities for Orange Silicon Valley, the innovation office of Orange Telecom in France. He is currently focusing on the 5G enabled business opportunities in both B2B and B2C sectors, cloud strategy, cloud gaming, and sustainability. He brings 15+ years of startup experience focusing on product management and user experience and 10+ years of corporate innovation and venture experience. He is an active supporter, mentor, and advisor to various startups, startup ecosystems, and the corporate venture ecosystem.\n\n\n\n![Andrew Byrnes](https://scet.berkeley.edu/wp-content/uploads/Andrew-byrnes_19-09-11_0209-150x150.jpg)\n\n[Andrew Byrnes](https://www.linkedin.com/in/byrnesandrew/), Director of Venture Capital at Micron Ventures and the AI Fund – loves working with founders to build world changing companies. Former startup founder/cleantech warrior/writer."
}