{
  "excerpt": "SCET Faculty Director & Chief Scientist, Prof. Ikhlaq Sidhu has been awarded the University of California, Berkeley’s [Extraordinary Teaching in Extraordinary Times Award](https://rtl.berkeley.edu/extraordinary-teaching-extraordinary-times-award) for demonstrating his commitment to students and excellence in teaching, even under extraordinarily difficult circumstances.\n\n\n\nIkhlaq Sidhu, SCET Chief Scientist and Faculty Director\n\nIkhlaq was nominated for his work on the SCET Data-X course, *Applied Data Science with Venture Applications*. With its significant team-based component, it wasn’t originally meant to be a remote learning experience, so when the COVID-19 pandemic hit, Ikhlaq decided to re-design the course.\n\nIn 2020, he led a team of undergraduate and graduate students to convert the course into a flipped-classroom model, so that time in the class could be used for interactive discussion and project presentations, and the lecture and homework content could be completed asynchronously. Over the summer, his team developed lecture videos, code samples, and project processes. The result was [Data-X Online](https://scet.berkeley.edu/data-x-lab-launches-data-x-online-democratizing-access-to-its-popular-course/), an open, online repository that supported the new course format and allowed anyone in the world to take the Data-X course. Students in the Fall 2020 course embraced the new format, creating innovative [projects](https://datax.berkeley.edu/projects/) that explored topics such as road safety, sports analytics, social connection, and police bias.\n\n“We are fortunate and grateful for Ikhlaq’s commitment to innovation and excellence in teaching for the Sutardja Center for Entrepreneurship and Technology,” says Tsu-Jae King Liu, Dean, College of Engineering.\n\nCongratulations to Ikhlaq! Learn more about Ikhlaq’s journey at SCET in this [recent piece celebrating 15 years of his leadership at UC Berkeley](https://scet.berkeley.edu/scet-is-celebrating-15-years-with-ikhlaq-sidhu/).",
  "feedKey": "Sutardja Center for Entrepreneurship & Technology",
  "templateKey": "rss-post",
  "author": "Keith McAleer",
  "date": "2021-04-23T22:24:29.282Z",
  "url": "https://scet.berkeley.edu/ikhlaq-sidhu-receives-extraordinary-teaching-in-extraordinary-times-award/",
  "title": "Ikhlaq Sidhu receives Extraordinary Teaching in Extraordinary Times Award",
  "id": "dsafa34#$$",
  "image": "/img/ikhlaq-1-.jpeg"
}