{
  "excerpt": "\n\n> “We launched a free app in the app store and 2 weeks later we get this call… ‘Heeeey it’s Steve, whatcha doin’? Wanna come over to my house tomorrow?'”\n>\n> Adam Cheyer on how Apple acquired Siri\n\nAdam Cheyer is the creator of Siri, Bixby, Viv Labs, Change.org, and Sentient. Billions of people have used his AI assistants. A talented magician, he sees many parallels between technology and magic.\n\n![](https://scet.berkeley.edu/wp-content/uploads/104485169-rsz_cheyer_portraits3068_1-1024x682.jpeg)\n\nIn a special talk given at the SCET’s 2021 [Newton Lecture Series](https://scet.berkeley.edu/students/courses/newton-series/spring-2021/), Adam Cheyer tells his audience the story of Siri, tying the company’s 20-year journey into a narrative of why and how to take an entrepreneurial idea from conception to impact.\n\n> “If it’s who you are, please go out and try and take your ideas into the world.”\n\n[A. Richard Newton Lecture Series - Adam Cheyer](https://www.youtube.com/embed/Ni89OVguF84?start=2&feature=oembed)\n\nAdam Cheyer is the creator of Siri, Bixby, Viv Labs, Change.org, and Sentient. Watch our A. Richard Newton Lecture Series video to watch Cheyer show you how to make your prototype magic.\n\n- - -\n\n## The story of Siri\n\nMany think Siri came out of nowhere. But the first version of Siri was made in 1993. The vision at the time was to create a multi-modal, conversational way to to interact with all information in the world through technology. What started as a funky research prototype turned into a grandiose 17-18 year project that would eventually affect billions.\n\nCheyer explains that the actually technology behind Siri required decades of hard work spent in the SRI International research lab building prototypes of AI-powered conversational assistants.\n\nIt was one day after years of research that Adam had the realization: “to take it into the world, I needed entrepreneurship.” Thus began the journey to bring this technology to consumers.\n\nTo take a rather crazy-sounding idea of “a conversational assistant for *all information*,” he needed a compelling name for this digital companion. According to Adam, his team wanted a human-like name that still felt exotic. They made a long list of names and Siri rose to the top, for a number of surprisingly meaningful reasons:\n\n* The team’s previous project, Iris, is a reversal of the name Siri.\n* In Norweigan, Siri means ‘beautiful woman who will lead you to victory.”\n* In Swahili, Siri means “secret.”\n\nThe Swahilian translation of *secret* was especially enthralling to the team behind Siri. They wanted to build something secretive, stealthy, and surprising that would emerge as a magical piece of technology and take the world by storm.\n\n- - -\n\n## The Phone Call\n\n2 weeks after the initial launch of Siri on the app store…\n\n> “Heeeey it’s Steve, whatcha doin’? Wanna come over to my house tomorrow?”\n\nThe Siri team was confused. They explicitly wanted to lay low and keep working on their stealth idea. They intentionally had no signs on the door. And their website only said “stealth idea.”\n\nNonetheless, you’re not going to *not* go to Steve Jobs’ house when he invites you. So they did. Literally the next day. They went to his house, and Steve asked to buy their company.\n\nFlattered, they said “No thanks, we’re not interested.”\n\nThe team was confident and convinced in their magical mission to bring Siri into the world their own way. But this vision was short-lived. Within 2 months, Steve had convinced them that their impact could be global if they partnered with Apple. And he was right.\n\nWithin months, and seeminlgy out of nowhere, Siri hit the devices of hundreds of millions of people across the globe.\n\n- - -\n\n## Adam’s Guide to Entrepreneurship\n\nReflecting on his successes with Siri, Bixby, Sentient, & Change.org, Adam shares his guide to actually doing the impossible task:\n\n> “How do you start a company, take an idea you’ve been working on, and put it into the world?”\n\nAccording to Adam, you need 3 things to become an entrepreneur.\n\n1. A big, differentiated, and magical idea.\n\nMake it ambitious & for a big market. Create a magical demonstration. If you can’t then, why is it better than competition? A prototype should be like magic to an investor. Make it magical, impossible, differentiated, so much that it is not even a question of “why is this better than anything else that I can get on the market today?” It just is.\n\n- - -\n\n```\n\n```\n\n- - -\n\n2. You need a visionary, markeeter, product expert, and engineer.\n\nThese are core roles that Cheyer finds the most important on any founding team. The visionary has the big ideas, and a clear vision as to why they’re important and how they’ll change the world. The marketeer is the storyteller, someone who can sell that vision to customers, investors, and employees. The product expert creates an actual roadmap — the way to actually get there. Step 1, then step 2, then step 3. Without the product expert, the end goal seems expert. Finally, the builder is the person who will deliver this on time and on budget.\n\nEvery entrepreneur who wants to start the company must ask themselves “which one am I?” Whichever one, aim to be really be great at that one or two skills you pick.\n\n> If you’re the builder, how are you gonna meet marketeers? You need to be identifying what you don’t do, going out, and finding those people. When you’ve identified what you are and what you’re not, you need to be actively seeking out people who are not like you. The other thing is, it’s going to take a lot of gut feel. If you have the team to pull it off, you’ll get money.\n\n3. Efficient decision making\n\nMoney equals time in entrepreneurship. You can calculate the amount of time you have before you die as a company. Just divide your companies total amount of funding by your daily expenditures.\n\nThat’s how many days you have left. With that amount of time that you’ve bought, you’ll have to produce more value than you’ve spent. If you can’t, the business goes bust.\n\nEven if you don’t fail but just find yourself pivoting too many times, suddenly it’s time to raise more but your investors will look at what you built and say “nope, I don’t see it anymore.” You earn the right to get on that first step, then raise money at a higher valuation and getting more time.\n\nAt the end, you either go profitable & control your own destiny, or you exit. At each step, it’s going to be about double. If you’ve raised at $10M valuation, then at $20M valuation, then $200M then $500M then $1B. If you’re not gonna get profitable soon, you need to exit as an IPO or get acquired. You’ve raised money, you’ve got the right team, now it’s all about making the right decisions.\n\n- - -\n\n## Q&A\n\n**What do you think about the future of human-computer interaction?**\n\nGeneral AI is far off. I don’t think in my lifetime we will see general AI. But if you look at what companies like Kernel and Neuralink are doing, it is clear that brain-computer interfaces will be around in my lifetime. The sort of cyborg-esque technology will be around. And I don’t necessarily like that, but it is going to come.\n\n**Do you have any books on entrepreneurship that you could recommend?**\n\nWhen I became an entrepreneur, I literally did not know what I was doing. There weren’t conferences to go to, I didn’t even know any entrepreneurs. I always took the approach of just make it up and go for it. For example, I started 3 companies at the same time. I’ve always personally had some distrust about entrepreneurship books, like “what are they selling?” However, meeting entrepreneurs and hearing their stories as best as possible is interesting and informative. If I were to pick one, there is a book called mad men of mobile. I was featured in one of the chapters. Basically, I would look for books that are about entrepreneurs in the space you care about, and just hear their stories. Take lessons with a grain of salt. If you find your own way, that’s the most important thing.\n\n**What are the industries you see causing a transformation in the next 10 years?**\n\nIn 2004, it was the 10th anniversary of the web. I saw the web taking off, and I made 10 public predictions for the next 10 years. And I took a month, read analyst reports, whatever was hot, and I came up with those 10 predictions. And that gave me an informed prediction about major trends. I then presented at a conference. Another prediction was that convenience would overtake privacy. He also said there’ll be a new user interface.\n\n*This lecture was part of the [A. Richard Newton Lecture Series: A Berkeley Changemaker™ course](https://scet.berkeley.edu/students/courses/newton-series/). Students interested in taking the course can find more information [here](https://scet.berkeley.edu/students/courses/newton-series/).*\n\n[](https://www.facebook.com/sharer.php?u=https%3A%2F%2Fscet.berkeley.edu%2Fthe-creator-of-siri%2F&t=The%20Creator%20of%20Siri%3A%20%E2%80%9CMake%20your%20prototype%20magic%E2%80%9D&s=100&p[url]=https%3A%2F%2Fscet.berkeley.edu%2Fthe-creator-of-siri%2F&p[images][0]=https%3A%2F%2Fscet.berkeley.edu%2Fwp-content%2Fuploads%2Foriginal.png&p[title]=The%20Creator%20of%20Siri%3A%20%E2%80%9CMake%20your%20prototype%20magic%E2%80%9D \"Share on Facebook\")",
  "feedKey": "Sutardja Center for Entrepreneurship & Technology",
  "templateKey": "rss-post",
  "author": "Kyle Giffin",
  "date": "2021-04-23T22:30:12.036Z",
  "url": "https://scet.berkeley.edu/the-creator-of-siri/",
  "title": "The Creator of Siri: “Make your prototype magic”",
  "id": "234324fdf234",
  "image": "/img/104485169-rsz_cheyer_portraits3068_1.jpeg"
}